/*****************************************
Problem:浮点数1        
Copyright: Doux
Author: Pumpkinorth
Date:2017/03/31 
Description:验证除1/2，1/4，1/8...等浮点数可以在计算机内被精确表示之外其他的浮点数在计算机内均为近似表示，
不能直接用精确等于==，判定大小是否相等时，一般用足够接近来判定如：|a-b|<seta（一个足够小的数） 
***************************************/
#include<stdio.h>
#include<math.h>
#include<stdlib.h>
int main()
{
	printf("0.2+0.1>0.3的布尔值为：%d\n",0.2+0.1>0.3);
	printf("0.2+0.1==0.3的布尔值为：%d\n",0.2+0.1==0.3);
	printf("|0.2+0.1|<0.0001的布尔值为：%d\n",abs(0.2+0.1)<0.00001);											// what the fuck!!!!!!!!!!!!!
	printf("|0.2+0.1-0.3|<0.0001的布尔值为：%d",abs(0.2+0.1-0.3)<0.00001);	
	printf("  此时就可以判断0.1+0.2=0.3\n");
	printf("0.25+0.25==0.5的布尔值为：%d\n",0.25+0.25==0.5);
	printf("0.25+0.25>0.5的布尔值为：%d\n",0.25+0.25>0.5);

} 
